# DistanceToNextLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCLevelInfo..::..DistanceToNextLevel Property
IFCLevelInfo Class See Also
---
The distance to the next story level.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double DistanceToNextLevel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DistanceToNextLevel As Double
	Get
```

Visual C++
---
```text
public:
property double DistanceToNextLevel {
	double get ();
}
```

# See Also
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace